// შექმენით car ობიექტი, რომელსაც მიანიჭებთ 3 თვისებას, ეს თვისებებია brand, model და color. თვისებებს აუცილებლად მიანიჭეთ მნიშვნელობები. თქვენი დავალებაა გამოიტანოთ კონსოლში თვისებების დასახელება და შემდეგ თვისებების მნიშვნელობები.
// თვისებების და მნიშვნელობების გამოტანის შემდეგ გამოიტანეთ გაერთიანებული ტექსი, სადაც ერთ ფრაზაში იქნება მოცემული ინფორმაცია. მაგ: ეს არის ... ბრენდი, კონკრეტულად ... მოდელი.


let car = {
    brand: "Nissan",
    model: "GTR",
    color: "Gray"
}

for(let cars in car){
    console.log(cars);
    console.log(car[cars]);    
}

console.log(`This is ${car.brand}, ${car.model} model and the color is ${car.color}`);